КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул5/КонтурЛогистика_ПЛ_Титул5.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул5</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул4</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСменаВодителя</name>
    <comment>ПризнКонцРейс</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфЗаезд</name>
    <comment>Дата формирования файла обмена информации о показаниях одометра при заезде транспортного средства на парковку (парковочное место)/при сдаче транспортного средства другому водителю</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфЗаезд</name>
    <comment>Время формирования файла обмена информации о показаниях одометра при заезде транспортного средства на парковку (парковочное место)/при сдаче транспортного средства другому водителю</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфВыезд</name>
    <comment>Дата формирования файла обмена Т4</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфВыезд</name>
    <comment>Время формирования файла обмена Т4</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфВыезд</name>
    <comment>Идентификатор файла обмена Т4</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПВыезд</name>
    <comment>Электронная подпись файла обмена информации о показаниях одометра при выезде транспортного средства с парковки (парковочного места)/при приеме транспортного средства от другого водителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрОдометр</name>
    <comment>Дата и время снятия показаний одометра</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияОдометра</name>
    <comment>Показания одометра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдометрРаботник</name>
    <comment>Сведения о лице, уполномоченном на проставление данных при выезде транспортного средства с парковки (парковочного места)/при приеме транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул5/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул5_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		КонтурЛогистика_ОбработкаДокументовСервер.ДополнитьДополнительныхПолучателейИзГлавногоДокумента(ЭтотОбъект, Титул1);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул5_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлуПЛ(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументТ1) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти исходный документ Титул1 путевого листа, создание не выполнено");
		
	Иначе
		
		Титул1 = НайденныйДокументТ1;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") = 0 Тогда 
			
			ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
			
		Иначе
			
			ЗаполнитьРеквизитыТитулаИзXDTOОтказ(XDTO);
			
		КонецЕсли;
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфЗаезд 	= КС.XDTO_Вычислить(XDTO, "Документ.СодИнфЗаезд");
	
	УИД_ПЛ 		= КС.XDTO_Вычислить(СодИнфЗаезд, "УИД_ПЛ");
	
	ДатИнфЗаезд 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфЗаезд"));
	ВрИнфЗаезд 		= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфЗаезд"));
	
	ДатФайлИнфВыезд = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфВыезд.ДатФайлИнфВыезд"));
	ВрФайлИнфВыезд 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфВыезд.ВрФайлИнфВыезд"));
	ИдФайлИнфВыезд 	= КС.XDTO_Вычислить(Документ, "ИдИнфВыезд.ИдФайлИнфВыезд");
	
	ЭПВыезд = КС.XDTO_Вычислить(Документ, "ИдИнфВыезд.ЭП");
	
	ТипПодпис_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	СпосПодтПолном_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.СпосПодтПолном");
	СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеИзXDTO(СпосПодтПолном_raw);
	
	Должность 	= КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.Должн");
	
	Фамилия 	= КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(Документ, "ПодпИнфЗаезд.ФИО.Отчество");
	
	ЭтоСменаВодителя = КС.XDTO_Вычислить(СодИнфЗаезд, "ПризнКонцРейс") = "2";
	
	Если ЭтоСменаВодителя Тогда 
		СвОдомСдачТС_XDTO 	= КС.XDTO_Вычислить(СодИнфЗаезд, "СвОдомСдачТС");
		ПоказанияОдометра 	= КС.XDTO_Вычислить(СвОдомСдачТС_XDTO, "ОдомСдачТС");
		ДатВрОдометр 		=  КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(КС.XDTO_Вычислить(СвОдомСдачТС_XDTO, "ДатВрСдачТС"));
	Иначе
		СвОдомЗаезд_XDTO 	= КС.XDTO_Вычислить(СодИнфЗаезд, "СвОдомЗаезд");
		ПоказанияОдометра 	= КС.XDTO_Вычислить(СвОдомЗаезд_XDTO, "ОдомЗаезд");   
		ДатВрОдометр 		= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(КС.XDTO_Вычислить(СвОдомЗаезд_XDTO, "ДатВрЗаезд"));
	КонецЕсли;
	
	ОдометрРаботник_raw = КС.XDTO_Вычислить(СодИнфЗаезд, "СвУплЛиц");
	ОдометрРаботник = КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(ОдометрРаботник_raw);
	
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTOОтказ(Знач XDTO)
	
	ЕстьОтказВПодписи = Истина;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	// Данные Подписанта
	XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
	
	Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
	Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
		
	ТекстУведомления 		= КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.СвУведУточ.ТекстУведУточ");	
	ПричинаОтказаВПодписи 	= ?(Не ТипЗнч(ТекстУведомления) = Тип("ОбъектXDTO"), ТекстУведомления, ""); 
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	УИД_ПЛ 	= ПредыдущийТитул.УИД_ПЛ;
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") Тогда 
		Титул1 	= ПредыдущийТитул;
	Иначе
		Титул1 	= ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	
	// поиск документа учетной системы
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ТипДокумента1С) Тогда
		
		НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыПоТипуЛогистика(Титул1, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
		
		Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
			ДокументОснование = НайденныйДокУчСист;
		КонецЕсли;
		
	КонецЕсли;
	
	Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4, Титул1);
	
	Если Не ЗначениеЗаполнено(ДатВрОдометр) Тогда
		ДатВрОдометр = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗаполнитьУказателиНаПредыдущийТитул(Титул1, Титул4);
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
	// Данные из рабочего места
	Если ДанныеЗаполнения.Свойство("ЭтоСменаВодителя") И ЗначениеЗаполнено(ДанныеЗаполнения.ЭтоСменаВодителя) Тогда
		ЭтоСменаВодителя = ДанныеЗаполнения.ЭтоСменаВодителя;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ОдометрРаботник") И ЗначениеЗаполнено(ДанныеЗаполнения.ОдометрРаботник) Тогда
		ОдометрРаботник = ДанныеЗаполнения.ОдометрРаботник;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ДанныеЗаполнения.Должность) Тогда
		Должность = ДанныеЗаполнения.Должность;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ПоказанияОдометра") И ЗначениеЗаполнено(ДанныеЗаполнения.ПоказанияОдометра) Тогда
		ПоказанияОдометра = ДанныеЗаполнения.ПоказанияОдометра;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрОдометр") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрОдометр) Тогда
		ДатВрОдометр = ДанныеЗаполнения.ДатВрОдометр;
	КонецЕсли;
	
	// ОдометрРаботник
	Если Не ЗначениеЗаполнено(ОдометрРаботник) И ЗначениеЗаполнено(Титул4) Тогда
		// Возьмем из Т4, чаще всего будет один сотрудник
		ОдометрРаботник = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Титул4, "ОдометрРаботник");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач Титул1, Титул4) Экспорт

	ФайлТитула4 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Титул4);
	
	Если Не ЗначениеЗаполнено(ФайлТитула4) Тогда 
		ВызватьИсключение "Не найден файл обмена Титулом 4 Путевого листа - невозможно создать Титул5: " + Титул4;
	КонецЕсли;
	
	ИдФайлИнфВыезд 	= СтрЗаменить(ФайлТитула4.ИмяФайла, ".xml", "");
	ДатФайлИнфВыезд 	= Титул4.ДатИнфВыезд;
	ВрФайлИнфВыезд  	= Титул4.ВрИнфВыезд;
	
	ДвоичныеДанныеПодписи = ФайлТитула4.Подпись.Получить();
	ЭПВыезд 				= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = ?(ЗначениеЗаполнено(Титул1.ОрганизацияТехСостояние), Титул1.ОрганизацияТехСостояние, Титул1.ЛицоОформившееПЛ);
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации = Неопределено) Экспорт
	
	Если КонтекстНастройкиКонвертации = Неопределено Тогда
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	КонецЕсли;
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул5.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфЗаезд = ТекущаяДатаСеанса();
		ВрИнфЗаезд = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфЗаезд, ВрИнфЗаезд);
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфТехСост и ВрИнфТехСост
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 5;
	Формат = "5.01";
	ТипДокументооборота = "__PL";
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ(НомерТитула, 
												Титул1.ЛицоОформившееПЛ,
												Титул1.ОрганизацияМедик,
												Титул1.ОрганизацияТехСостояние,
												Титул1.ОрганизацияОдометр,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ОрганизацияПодписанта = ?(ЗначениеЗаполнено(Титул1.ОрганизацияТехСостояние), Титул1.ОрганизацияТехСостояние, Титул1.ЛицоОформившееПЛ);
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОрганизацияПодписанта, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_ИдИнфВыезд 		= КС.XDTO_ПЛ_ИдИнфВыезд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфВыезд", XDTO_ИдИнфВыезд);
	
	// там чойс оказывается
	//XDTO_ИдИнфТехСост 		= КС.XDTO_ПЛ_ИдИнфТехСост(НомерТитула, Формат, Ссылка);
	//КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфТехСост", XDTO_ИдИнфТехСост);
	
	XDTO_СодИнфЗаезд = КС.XDTO_ПЛ_СодИнфЗаезд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфЗаезд", XDTO_СодИнфЗаезд);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
